---
type: StructuralSectionRectangleParameterized
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 1
tags: [revit-api, class]
---

# StructuralSectionRectangleParameterized

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangleParameterized` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionRectangleParameterized | 2015 | `public StructuralSectionRectangleParameterized ( double width , double height , double centroidHorizontal , double centroidVertical , double principalAxesAngle , double sectionArea , double perimeter , double nominalWeig` |